package com.sdamir66.dadban.calendar.prayer;

public enum Method {
    JAFARI,     // شیعه اثناعشری (فجر 16، عشا 14)
    KARACHI,    // دانشگاه علوم اسلامی کراچی (فجر 18، عشا 18)
    ISNA,       // انجمن اسلامی آمریکای شمالی (فجر 15، عشا 15)
    MWL,        // اتحادیه جهانی مسلمانان (فجر 18، عشا 17)
    MAKKAH,     // دانشگاه ام‌القری مکه (فجر 18.5، عشا 90 دقیقه بعد از مغرب)
    EGYPT,      // هیئت عمومی مصر (فجر 19.5، عشا 17.5)
    TEHRAN,     // مؤسسه ژئوفیزیک دانشگاه تهران (فجر 17.7، عشا 14، مغرب 4.5)
    CUSTOM      // سفارشی
}
